#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.ecs_taskdef_travelapp.data.aws_iam_policy_document.main: Reading...
module.vpc.aws_vpc.main: Refreshing state... [id=vpc-07370bdafa53b8c4f]
module.ecr.aws_ecr_repository.main: Refreshing state... [id=travelapp-ecr]
module.ecs_cluster.aws_ecs_cluster.main: Refreshing state... [id=arn:aws:ecs:us-east-1:378842471989:cluster/travelapp-cluster]
module.ecs_taskdef_travelapp.data.aws_iam_policy_document.custom: Reading...
module.ecs_ssm.aws_ssm_parameter.main["DB_HOSTNAME"]: Refreshing state... [id=DB_HOSTNAME]
module.ecs_service.aws_ecs_service.main: Refreshing state... [id=arn:aws:ecs:us-east-1:378842471989:service/travelapp-cluster/travelapp-service]
module.ecs_taskdef_travelapp.data.aws_iam_policy_document.main: Read complete after 0s [id=1077804475]
module.ecs_taskdef_travelapp.data.aws_iam_policy_document.custom: Read complete after 0s [id=3750463013]
module.ecs_taskdef_travelapp.aws_iam_policy.main: Refreshing state... [id=arn:aws:iam::378842471989:policy/ECS-Allow-All]
module.ecs_taskdef_travelapp.aws_iam_role.main: Refreshing state... [id=ECS-TravelApp-Role]
module.ecs_cluster.aws_ecs_cluster_capacity_providers.example: Refreshing state... [id=travelapp-cluster]
module.ecs_taskdef_travelapp.aws_iam_role_policy_attachment.main: Refreshing state... [id=ECS-TravelApp-Role-20231214174657259600000001]
module.ecs_taskdef_travelapp.aws_ecs_task_definition.main: Refreshing state... [id=travelapp-taskdefintion]
module.vpc.aws_internet_gateway.main[0]: Refreshing state... [id=igw-03ab51c457fad06d3]
module.vpc.aws_subnet.public_subnets[0]: Refreshing state... [id=subnet-01a9331b22ab97a18]
module.rds_public_sg.aws_security_group.main: Refreshing state... [id=sg-079b9b8919dff4d83]
module.public_sg.aws_security_group.main: Refreshing state... [id=sg-0feda0c9e5bab127f]
module.vpc.aws_route_table.main: Refreshing state... [id=rtb-0299c90bb8997687c]
module.vpc.aws_subnet.public_subnets[1]: Refreshing state... [id=subnet-0299bc63a7ad5223e]
module.vpc.aws_route.igw_route[0]: Refreshing state... [id=r-rtb-0299c90bb8997687c1080289494]
module.vpc.aws_route_table_association.public_subnets_route_association[0]: Refreshing state... [id=rtbassoc-064ff63696fb58293]
module.vpc.aws_route_table_association.public_subnets_route_association[1]: Refreshing state... [id=rtbassoc-08029f31cc5f59667]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.ecs_ssm.aws_ssm_parameter.main["DB_HOST"] will be created
  + resource "aws_ssm_parameter" "main" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "DB_HOST"
      + tags           = {
          + "Name" = "DB_HOST"
        }
      + tags_all       = {
          + "Environment" = "Test"
          + "Managed-by"  = "Terraform"
          + "Name"        = "DB_HOST"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.ecs_ssm.aws_ssm_parameter.main["DB_HOSTNAME"] will be destroyed
  # (because key ["DB_HOSTNAME"] is not in for_each map)
  - resource "aws_ssm_parameter" "main" {
      - arn       = "arn:aws:ssm:us-east-1:378842471989:parameter/DB_HOSTNAME" -> null
      - data_type = "text" -> null
      - id        = "DB_HOSTNAME" -> null
      - name      = "DB_HOSTNAME" -> null
      - tags      = {
          - "Name" = "DB_HOSTNAME-tag"
        } -> null
      - tags_all  = {
          - "Environment" = "Test"
          - "Managed-by"  = "Terraform"
          - "Name"        = "DB_HOSTNAME-tag"
        } -> null
      - tier      = "Standard" -> null
      - type      = "String" -> null
      - value     = (sensitive value) -> null
      - version   = 1 -> null
    }

  # module.ecs_ssm.aws_ssm_parameter.main["DB_NAME"] will be created
  + resource "aws_ssm_parameter" "main" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "DB_NAME"
      + tags           = {
          + "Name" = "DB_NAME"
        }
      + tags_all       = {
          + "Environment" = "Test"
          + "Managed-by"  = "Terraform"
          + "Name"        = "DB_NAME"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.ecs_ssm.aws_ssm_parameter.main["DB_PASSWORD"] will be created
  + resource "aws_ssm_parameter" "main" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "DB_PASSWORD"
      + tags           = {
          + "Name" = "DB_PASSWORD"
        }
      + tags_all       = {
          + "Environment" = "Test"
          + "Managed-by"  = "Terraform"
          + "Name"        = "DB_PASSWORD"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.ecs_ssm.aws_ssm_parameter.main["DB_USERNAME"] will be created
  + resource "aws_ssm_parameter" "main" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "DB_USERNAME"
      + tags           = {
          + "Name" = "DB_USERNAME"
        }
      + tags_all       = {
          + "Environment" = "Test"
          + "Managed-by"  = "Terraform"
          + "Name"        = "DB_USERNAME"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.ecs_taskdef_travelapp.aws_ecs_task_definition.main must be replaced
-/+ resource "aws_ecs_task_definition" "main" {
      ~ arn                      = "arn:aws:ecs:us-east-1:378842471989:task-definition/travelapp-taskdefintion:2" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-1:378842471989:task-definition/travelapp-taskdefintion" -> (known after apply)
      ~ container_definitions    = jsonencode(
            [
              - {
                  - cpu          = 512
                  - environment  = []
                  - essential    = true
                  - image        = "378842471989.dkr.ecr.us-east-1.amazonaws.com/travelapp-ecr:1"
                  - memory       = 1024
                  - mountPoints  = []
                  - name         = "travelapp-container"
                  - portMappings = [
                      - {
                          - containerPort = 80
                          - hostPort      = 80
                          - protocol      = "tcp"
                        },
                    ]
                  - secrets      = [
                      - {
                          - name      = "DB_HOSTNAME"
                          - valueFrom = "arn:aws:ssm:us-east-1:378842471989:parameter/DB_HOSTNAME"
                        },
                    ]
                  - volumesFrom  = []
                },
            ] # forces replacement
        ) -> (known after apply) # forces replacement
      ~ id                       = "travelapp-taskdefintion" -> (known after apply)
      ~ revision                 = 2 -> (known after apply)
        tags                     = {
            "Name" = "travelapp-taskdefintion"
        }
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 5 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  ~ ssm_db_host              = "arn:aws:ssm:us-east-1:378842471989:parameter/DB_HOSTNAME" -> (known after apply)
  ~ ssm_param_arns           = {
      + DB_HOST     = (known after apply)
      - DB_HOSTNAME = "arn:aws:ssm:us-east-1:378842471989:parameter/DB_HOSTNAME"
      + DB_NAME     = (known after apply)
      + DB_PASSWORD = (known after apply)
      + DB_USERNAME = (known after apply)
    }

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>
*Pushed by: @bertei, Action: `pull_request`*